# Практика

## Разминка

1. Создайте в своём репозитории `2022-polytech-%фамилия%` пустой файл README.md в каталоге `02_compiler`
2. Сделайте коммит
3. Добавьте пустой файл `hello_world.cpp`
4. Сделайте коммит
5. Напишите программу, которая выводит строку `Hello World!`
6. Проверьте, что программа работает в сервисе https://www.onlinegdb.com
7. Сделайте коммит
8. Синхронизуйте репозиторий с GitHub

## Задание

### Работа с gcc
1. Установите gcc
2. Установите CMake
3. Соберите программу, проверьте, что она работает
4. Сгенерируйте код ассемблера
5. Сделайте коммит и синхронизируйте с GitHub
6. Добавьте 2 файла `func.h` и `func.cpp` (сделайте код рабочим)
```cpp
// func.h
void print();
```

```cpp
// func.cpp
void print()
{
  // здесь вывод Hello World!
}
```
7. Добавьте файл `func.h` в файл `hello_world.cpp` с помощью `#include`
8. Используйте `print();` вместо строки вывода в файле `hello_world.cpp`
9. Соберите программу, проверьте, что она работает

### Работа с cmake
1. Напишите `CMakeLists.txt` файл для сборки проека выше
2. Соберите программу, проверьте, что она работает
3. Сделайте коммит и синхронизируйте с GitHub

## Домашнее задание
1. Создайте файл с более сложной программой. Пока не важно, что внутри. Просто скопируйте код в ваш файл.

```cpp
// func.cpp
 #include <iostream>

 double powern (double d, unsigned n)
 {
   double x = 1.0;

   for (int j = 1; j <= n; j++)
   {
       x *= d;
   }

   return x;
 }

 int main ()
 {
   double sum = 0.0;

   for (int i = 1; i <= 100000000; i++)
     {
       sum += powern (i, i % 5);
     }

   std::cout << "sum=" << sum << std::endl;
   return 0;
 }
```
2. Добавьте файл в репозиторий
3. Скомпилирйте файл с разными уровнями оптимизации компилятора (см. документацию)
4. 

*Комментарии*
- Если у вас нет прав на установку программ, то можно попробовать скачать переносимую (portable) версию.
- В этом файле есть опечатки, вы можете их исправить через pull request.
