# Практика

## Разминка

1. Создайте в своём репозитории `2022-polytech-%фамилия%` пустой файл README.md в каталоге `02_compiler`
2. Сделайте коммит
3. Добавьте пустой файл `hello_world.cpp`
4. Сделайте коммит
5. Напишите программу, которая выводит строку `Hello World!`
6. Проверьте, что программа работает в сервисе https://www.onlinegdb.com
7. Сделайте коммит
8. Синхронизуйте репозиторий с GitHub

## Задание

### Работа с gcc
1. Установите gcc
2. Установите CMake
3. Соберите программу, проверьте, что она работает
4. Сгенерируйте код ассемблера
5. Сделайте коммит и синхронизируйте с GitHub
6. Добавьте 2 файла `func.h` и `func.cpp` (сделайте код рабочим)
```cpp
// func.h
void print();
```

```cpp
// func.cpp
void print()
{
  // здесь вывод Hello World!
}
```
7. Добавьте файл `func.h` в файл `hello_world.cpp` с помощью `#include`
8. Используйте `print();` вместо строки вывода в файле `hello_world.cpp`
9. Соберите программу, проверьте, что она работает

### Работа с cmake
1. Напишите `CMakeLists.txt` файл для сборки проека выше
2. Соберите программу, проверьте, что она работает
3. Сделайте коммит и синхронизируйте с GitHub

## Домашнее задание

